Reports/бит_СпискиПоНаселению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_СпискиПоНаселению</Name>
			<Comment>Списки граждан прибывших и убывших за период времени</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>мПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПаспортныеДанныеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПаспортныеДанныеПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыУдостоверяющиеЛичность</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПричинаЗамены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ГражданствоПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ГражданствоПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИмеетПравоНаПенсию</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеЯвляетсяНалоговымРезидентомРФ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИмеетПравоНаМедицинскоеСтрахование</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_СтатусПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СтатусПроживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Временно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроживает</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/бит_СпискиПоНаселению/Forms/ФормаОтчетаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
   	ДатаНач = НачалоМесяца(ТекущаяДата());
	ДатаКон = КонецМесяца(ТекущаяДата());
    КолЛет = 14;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	Попытка
		СформироватьНаСервере();
	Исключение	
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	ОтчетОбъект = ДанныеФормыВЗначение(Отчет, Тип("ОтчетОбъект.бит_СпискиПоНаселению"));
	РезультатЗапроса = СпискиПоНаселениюИнициализация();
	
	ОтчетОбъект.СпискиГражданПрописанныхВыписанныхВывести(ДатаНач, ДатаКон,КолЛет,Результат,РезультатЗапроса);
	
	
КонецПроцедуры

&НаСервере
Функция СпискиПоНаселениюИнициализация()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	
		"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛС.Период,
	|	бит_ПроживающиеПоЛС.ФизЛицо,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица,
	|	ВЫБОР
	|		КОГДА (бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации = &ПустаяДата
	|				ИЛИ бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации ЕСТЬ NULL )
	|				И (бит_ПроживающиеПоЛС.ДатаРегистрации = &ПустаяДата
	|					ИЛИ бит_ПроживающиеПоЛС.ДатаРегистрации ЕСТЬ NULL )
	|			ТОГДА ВЫБОР
	|					КОГДА бит_ПроживающиеПоЛС.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
	|						ТОГДА бит_ПроживающиеПоЛС.Период
	|					ИНАЧЕ &ПустаяДата
	|				КОНЕЦ
	|		ИНАЧЕ бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации
	|	КОНЕЦ КАК ДатаСнятияСРегистрации,
	|	ВЫБОР
	|		КОГДА (бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации = &ПустаяДата
	|				ИЛИ бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации ЕСТЬ NULL )
	|				И (бит_ПроживающиеПоЛС.ДатаРегистрации = &ПустаяДата
	|					ИЛИ бит_ПроживающиеПоЛС.ДатаРегистрации ЕСТЬ NULL )
	|			ТОГДА ВЫБОР
	|					КОГДА бит_ПроживающиеПоЛС.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.ВременнаяРегистрация)
	|							ИЛИ бит_ПроживающиеПоЛС.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.ПостояннаяРегистрация)
	|						ТОГДА бит_ПроживающиеПоЛС.Период
	|					ИНАЧЕ &ПустаяДата
	|				КОНЕЦ
	|		ИНАЧЕ бит_ПроживающиеПоЛС.ДатаРегистрации
	|	КОНЕЦ КАК ДатаРегистрации,
	|	бит_ПроживающиеПоЛС.ДатаЗаписи КАК ДатаОкончанияСтатуса,
	|	бит_ПроживающиеПоЛС.ФизЛицо.Пол,
	|	бит_ПроживающиеПоЛС.ФизЛицо.МестоРождения,
	|	бит_ПроживающиеПоЛС.ФизЛицо.ДатаРождения,
	|	бит_ПроживающиеПоЛС.СтатусПроживания,
	|	&ПустаяДата,
	|	бит_ПроживающиеПоЛС.Регистратор,
	|	бит_ПроживающиеПоЛС.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
	|	бит_ПроживающиеПоЛС.ЛицевойСчет.Здание КАК Здание,
	|	бит_ПроживающиеПоЛС.ЛицевойСчет.Квартира КАК Квартира,
	|	бит_ПроживающиеПоЛС.ЛицевойСчет.Здание.Корпус КАК Корпус,
	|	бит_ПроживающиеПоЛС.ЛицевойСчет,
	|	ВЫБОР
	|		КОГДА бит_ПроживающиеПоЛС.ФизЛицо.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ &ДатаКон < бит_ПроживающиеПоЛС.ФизЛицо.ДатаРождения
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(бит_ПроживающиеПоЛС.ФизЛицо.ДатаРождения, &ДатаКон, МЕСЯЦ) / 12
	|	КОНЕЦ КАК КолЛет
	|ПОМЕСТИТЬ СписокФизЛиц
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
	|ГДЕ
	|	(ЕСТЬNULL(бит_ПроживающиеПоЛС.ДатаРегистрации, ВЫБОР
	|					КОГДА бит_ПроживающиеПоЛС.ДатаРегистрации ЕСТЬ NULL 
	|							ИЛИ бит_ПроживающиеПоЛС.ДатаРегистрации = &ПустаяДата
	|						ТОГДА бит_ПроживающиеПоЛС.Период
	|				КОНЕЦ) >= &ДатаНач
	|			ИЛИ ЕСТЬNULL(бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации, ВЫБОР
	|					КОГДА бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации ЕСТЬ NULL 
	|							ИЛИ бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации = &ПустаяДата
	|						ТОГДА бит_ПроживающиеПоЛС.Период
	|				КОНЕЦ) >= &ДатаНач
	|			ИЛИ бит_ПроживающиеПоЛС.Период >= &ДатаНач)
	|	И (бит_ПроживающиеПоЛС.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.ПостояннаяРегистрация)
	|			ИЛИ бит_ПроживающиеПоЛС.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан))
	|	И бит_ПроживающиеПоЛС.СтатусПроживания = ЗНАЧЕНИЕ(перечисление.бит_СтатусПроживания.Постоянно)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокФизЛиц.Регистратор,
	|	СписокФизЛиц.ЛицевойСчет,
	|	СписокФизЛиц.ФизЛицо,
	|	СписокФизЛиц.КолЛет,
	|	СписокФизЛиц.ФизЛицоДатаРождения КАК ДатаРождения,
	|	СписокФизЛиц.СтатусФизЛица КАК Статус,
	|	СписокФизЛиц.СтатусПроживания,
	|	СписокФизЛиц.ДатаРегистрации КАК ДатаРегистрации,
	|	СписокФизЛиц.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	СписокФизЛиц.ДатаОкончанияСтатуса,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид.КодПФР КАК Документ,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК ДокСерия,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК ДокНомер,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ДокКемВыдан,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДокДатаВыдачи,
	|	бит_ГражданствоПроживающихСрезПоследних.Страна КАК Гражданство,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	СписокФизЛиц.ФизЛицоПол КАК ПолФизЛицо,
	|	СписокФизЛиц.ФизЛицоМестоРождения КАК МестоРождения,
	|	СписокФизЛиц.Улица,
	|	СписокФизЛиц.Здание,
	|	СписокФизЛиц.Корпус,
	|	СписокФизЛиц.Квартира
	|ИЗ
	|	СписокФизЛиц КАК СписокФизЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(
	|				&ДатаКон,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокФизЛиц.ФизЛицо
	|					ИЗ
	|						СписокФизЛиц КАК СписокФизЛиц)) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО СписокФизЛиц.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(
	|				&ДатаКон,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокФизЛиц.ФизЛицо
	|					ИЗ
	|						СписокФизЛиц КАК СписокФизЛиц)) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО СписокФизЛиц.ФизЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГражданствоПроживающих.СрезПоследних(
	|				&ДатаКон,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокФизЛиц.ФизЛицо
	|					ИЗ
	|						СписокФизЛиц КАК СписокФизЛиц)) КАК бит_ГражданствоПроживающихСрезПоследних
	|		ПО СписокФизЛиц.ФизЛицо = бит_ГражданствоПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	(СписокФизЛиц.ДатаРегистрации >= &ДатаНач
	|				И СписокФизЛиц.ДатаРегистрации <= &ДатаКон
	|			ИЛИ СписокФизЛиц.ДатаСнятияСРегистрации >= &ДатаНач
	|				И СписокФизЛиц.ДатаСнятияСРегистрации <= &ДатаКон)
	|	И СписокФизЛиц.КолЛет >= &КолЛет
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписокФизЛиц.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокФизЛиц";         
	
	
	Запрос.УстановитьПараметр("ДатаНач",ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",ДатаКон);
	Запрос.УстановитьПараметр("КолЛет",КолЛет);
	Запрос.УстановитьПараметр("ПустаяДата",Дата('00010101'));

	 РезультатЗапроса = Запрос.Выполнить();
	 
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти
